# Shared — installed on both personal and work machines

# Taps
tap "arthur-ficial/tap"

# CLI Tools
brew "git"
brew "exiftool"
brew "bat"
brew "fzf"
brew "ffmpeg"
brew "gemini-cli"
brew "gh"
brew "go"
brew "htop"
brew "hugo"
brew "jq"
brew "lsd"
brew "neovim"
brew "node"
brew "nmap"
brew "openjdk"
brew "pnpm"
brew "ruby", link: true
brew "speedtest-cli"
brew "tree"
brew "wget"
brew "yq"
brew "codex"
brew "python@3.13"
brew "python@3.14"
brew "arthur-ficial/tap/apfel"

# GUI Apps
cask "bartender"
cask "calibre"
cask "chatgpt"
cask "discord"
cask "espanso"
cask "font-monaspace"
cask "forklift"
cask "obs"
cask "obsidian"
cask "raycast"
cask "steam"
cask "todoist-app"
cask "vlc"

# VS Code Extensions
vscode "aykutsarac.jsoncrack-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "irongeek.vscode-env"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"
